In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = sns.load_dataset('planets')

### Print/ Display the first 5 rows of dataframe

In [3]:
# your code here
df.head(5)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

### Print/ Display the last 5 rows of dataframe

In [4]:
# your code here
df.tail(5)

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

### How many unique methods are there?

In [6]:
# your code here
df['method'].nunique()

10

### What is the number of data collected in each year?

In [14]:
# your code here
df.groupby('year').size().reset_index()

    year    0
0   1989    1
1   1992    2
2   1994    1
3   1995    1
4   1996    6
5   1997    1
6   1998    5
7   1999   15
8   2000   16
9   2001   12
10  2002   32
11  2003   25
12  2004   26
13  2005   39
14  2006   31
15  2007   53
16  2008   74
17  2009   98
18  2010  102
19  2011  185
20  2012  140
21  2013  118
22  2014   52

### Which columns have missing values and how many?

In [15]:
# your code here
df.isnull().sum()

method              0
number              0
orbital_period     43
mass              522
distance          227
year                0
dtype: int64

### Write docstring for the function below.

In [26]:
def do_something(x, y, z):
    """
    Üç verilen sayının ters toplamını hesaplar.

    Bu fonksiyon, x, y ve z olmak üzere üç sayısal değeri girdi olarak alır ve bu değerlerin ters toplamını 
    şu formül doğrultusunda hesaplar: 1/x + 1/y + 1/z.
    """   

    result = 1 / x + 1 / y + 1 / z

    return 1 / result

### Get (print) the docstring of the function defined above.

In [30]:
# your code here

print(do_something.__doc__)

    Üç verilen sayının ters toplamını hesaplar.

    Bu fonksiyon, x, y ve z olmak üzere üç sayısal değeri girdi olarak alır ve bu değerlerin ters toplamını
    şu formül doğrultusunda hesaplar: 1/x + 1/y + 1/z. Ardından elde edilen toplamın tersini döndürür.

### Call do_something function for the (11,13,15) values and save it as result

In [28]:
# your code here

result=do_something(11,13,15)
result

4.26441351888668

### In the variable 's' containing a sentence, extract the word using result defined above as index

In [29]:
s = "I love Machine Learning and Deep Learning"

# use int() to convert the result to integer
# your code here
index = int(result)
extracted_word = s.split()[index]
extracted_word

'and'

### Sort the given array below, do not use built in functions. All sorting methods are allowed.

In [12]:
import random
arr = [random.randint(1, 100) for i in range(10)]
# your code here
n= len(arr)
def bubbles_sortest(arr):
    for i in range(n):
        for j in range(n-i-1):
            if arr[j]> arr[j+1]:
                arr[j],arr[j+1]=arr[j+1],arr[j]
    return arr
bubbles_sortest(arr)

[1, 25, 27, 33, 43, 58, 61, 94, 95, 100]

### define a recursive function to calculate input numbers factorial named factorial

In [31]:
# your code here
def factorial(n):
    
    if n==1 or n==0:
        return 1
    else:
        return n*factorial(n-1)
sayi= int(input('bir değer giriniz:'))
print(f"{sayi} faktoriyeli:",factorial(sayi))

bir değer giriniz:5
5 faktoriyeli 120

### define a function to merge the given arrays and calculate the median named twoMedian

In [25]:
# your code here
def twoMedian(arr1,arr2):
    
    merged_array= arr1+arr2
    merged_array.sort()
    
    lenght= len(merged_array)
    
    if lenght %2 ==0:
        mid = lenght//2
        median= (merged_array[mid-1]+ merged_array[mid])/2
        
    else:
        mid= lenght//2
        median= merged_array[mid]
    return median

array1=[10,15,78,45]
array2=[1,4,5,79,6]

result= twoMedian(array1,array2)

print(f"Merged two arrays medain:{result}")

Merged two arrays medain:10